Tekla Open API Reference for Tekla Structures 2025
Intersection.LineSegmentToPlane Method
 Returns a new point which is an intersection of the given line segment and plane or null if the line segment and the plane are parallel or do not intersect.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point LineSegmentToPlane(
	LineSegment lineSegment,
	GeometricPlane plane
)
Public Shared Function LineSegmentToPlane (
	lineSegment As LineSegment,
	plane As GeometricPlane
) As Point
Parameters
lineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
The line segment to be used.
plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Return Value
Type: Point
The intersection point or null if no intersection was found.
See Also
Reference
Intersection Class
Tekla.Structures.Geometry3d Namespace